<?php
// +----------------------------------------------------------------------
// | 咪咕CMS[基于ThinkPHP5.1开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2021 http://www.migucms.com
// +----------------------------------------------------------------------
// | 咪咕CMS承诺基础框架永久免费开源，您可用于学习，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: btc
// +----------------------------------------------------------------------
namespace app\common\model;

use think\Model;
/**
 * 附件分组模型
 * @package app\common\model
 */
class SystemAnnexGroup extends Model
{
    // 自动写入时间戳
    protected $autoWriteTimestamp = false;

}
