<?php
// +----------------------------------------------------------------------
// | 咪咕CMS[基于ThinkPHP5.1开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2021 http://www.migucms.com
// +----------------------------------------------------------------------
// | 咪咕CMS承诺基础框架永久免费开源，您可用于学习，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: btc
// +----------------------------------------------------------------------

namespace app\system\validate;

use think\Validate;

/**
 * 钩子验证器
 * @package app\system\validate
 */
class Hook extends Validate
{
    //定义验证规则
    protected $rule = [
		'name|钩子名称'	=> 'require|alphaDash|unique:system_hook',
		'intro|钩子描述' => 'require',
    ];
}
